---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBldgConsMtlThermalProps
source: html/752ad5f6-868c-ba0c-ad1d-f1b92c824a66.htm
---
# Autodesk.Revit.DB.GroupTypeId.EnergyAnalysisBldgConsMtlThermalProps Property

Material Thermal Properties.

## Syntax (C#)
```csharp
public static ForgeTypeId EnergyAnalysisBldgConsMtlThermalProps { get; }
```